In [1]:
import pandas as pd

In [14]:
input_file = '../data/sales_data.csv'

In [15]:
df = pd.read_csv(input_file)

In [4]:
df.head(5)

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,38.631913,-121.434879
1,51 OMAHA CT,SACRAMENTO,95823,CA,3,1,1167,Residential,Wed May 21 00:00:00 EDT 2008,68212,38.478902,-121.431028
2,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,Wed May 21 00:00:00 EDT 2008,68880,38.618305,-121.443839
3,2805 JANETTE WAY,SACRAMENTO,95815,CA,2,1,852,Residential,Wed May 21 00:00:00 EDT 2008,69307,38.616835,-121.439146
4,6001 MCMAHON DR,SACRAMENTO,95824,CA,2,1,797,Residential,Wed May 21 00:00:00 EDT 2008,81900,38.519470,-121.435768

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 985 entries, 0 to 984
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   street     985 non-null    object
 1   city       985 non-null    object
 2   zip        985 non-null    int64
 3   state      985 non-null    object
 4   beds       985 non-null    int64
 5   baths      985 non-null    int64
 6   sq__ft     985 non-null    int64
 7   type       985 non-null    object
 8   sale_date  985 non-null    object
 9   price      985 non-null    int64
 10  latitude   985 non-null    float64
 11  longitude  985 non-null    float64
dtypes: float64(2), int64(5), object(5)
memory usage: 92.5+ KB

In [6]:
df2 = df[(df.beds != 0) | (df.baths != 0)].copy()
df2 = df[df.sq__ft != 0].copy()

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 814 entries, 0 to 984
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   street     814 non-null    object
 1   city       814 non-null    object
 2   zip        814 non-null    int64
 3   state      814 non-null    object
 4   beds       814 non-null    int64
 5   baths      814 non-null    int64
 6   sq__ft     814 non-null    int64
 7   type       814 non-null    object
 8   sale_date  814 non-null    object
 9   price      814 non-null    int64
 10  latitude   814 non-null    float64
 11  longitude  814 non-null    float64
dtypes: float64(2), int64(5), object(5)
memory usage: 82.7+ KB

In [8]:
df2['price_per_sqft'] = df2['price'] / df2['sq__ft']
df2['avg_price_per_sqft'] = df2['price_per_sqft'].mean()

In [9]:
df2[['price', 'sq__ft', 'price_per_sqft', 'avg_price_per_sqft']]

      price  sq__ft  price_per_sqft  avg_price_per_sqft
0     59222     836       70.839713          145.673253
1     68212    1167       58.450728          145.673253
2     68880     796       86.532663          145.673253
3     69307     852       81.346244          145.673253
4     81900     797      102.760351          145.673253
..      ...     ...             ...                 ...
980  232425    2280      101.940789          145.673253
981  234000    1477      158.429248          145.673253
982  235000    1216      193.256579          145.673253
983  235301    1685      139.644510          145.673253
984  235738    1362      173.082232          145.673253

[814 rows x 4 columns]

In [10]:
df_final = df2[df2['price_per_sqft'] < df2['avg_price_per_sqft']]

In [13]:
df_final.to_csv('../data/output_sales_data.csv', index=False)